CfdOfRuns/vonKarman2D_cfMesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.05 -0.01 0.0);

boundaryField
{
    
    emptyWalls
    {
        type        empty;
    }
    
    wall
    {
        // movingWallVelocity reduces to fixedValue if the mesh is not moving
        type        movingWallVelocity;
        value       uniform (0 0 0);
    }

    inlet
    {
        // Fix all three components of velocity on inflow and only the normal component on outflow,
        // in order to be well-posed if there are some faces on the patch which are actually outflows.
        type                fixedNormalInletOutletVelocity;
        fixTangentialInflow yes;
        normalVelocity
        {
            type            fixedValue;
            value           uniform ( 0.13 0.0 0.0 );
        }
        value               uniform ( 0.13 0.0 0.0 );
    }

    outlet
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

    open
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

    open001
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

}

// ************************************************************************* //
