CfdOfRuns/vonKarman2D_cfMesh/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
120950
(
(2.4636216e-18 1.2318108e-17 1.1702203e-15)
(-2.5477585e-18 -1.2738793e-17 -6.1146205e-15)
(-7.2801818e-20 -3.6400909e-19 -1.2170412)
(6.467109e-20 3.2335545e-19 -1.2106437)
(0 -0 -1.2395701)
(-2.2891889e-19 -1.1445944e-18 -1.2047969)
(0 -0 -1.2110929)
(5.5849368e-20 2.7924684e-19 -1.1859681)
...
)
;

boundaryField
{
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
168
(
(1.9638161e-16 9.8190806e-16 402.97581)
(-2.7720036e-19 -1.3860018e-18 651.34886)
(-2.5044254e-16 -1.2522127e-15 486.55914)
(1.5284168e-17 7.642084e-17 537.07799)
(0 -0 499.16107)
(-9.1640596e-16 -4.5820298e-15 -396.44398)
(-7.4633457e-16 -3.7316729e-15 -396.51306)
(-1.2014933e-15 -6.0074666e-15 -627.78729)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(6.467109e-20 3.2335545e-19 0)
(0 -0 -1.2086811e-16)
(-2.2891889e-19 -1.1445944e-18 3.6627022e-16)
(0 -0 -7.0011141e-16)
(5.5849368e-20 2.7924684e-19 1.8988785e-16)
(0 -0 -2.7460432e-16)
(0 -0 5.5097895e-16)
(6.103596e-20 3.051798e-19 1.3733091e-16)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
231
(
(2.5489279e-18 1.274464e-17 7.6467837e-16)
(0 -0 -4.4743291e-16)
(0 -0 -8.9515027e-16)
(-8.0406565e-18 -4.0203283e-17 6.8345581e-15)
(8.7157642e-18 4.3578821e-17 -2.1789411e-16)
(0 -0 0)
(2.8293699e-19 1.4146849e-18 0)
(-2.8889379e-19 -1.444469e-18 0)
...
)
;
    }
    open
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(-2.5477585e-18 -1.2738793e-17 2.0382068e-15)
(1.2779995e-18 6.3899977e-18 -1.1661746e-15)
(4.4751744e-18 2.2375872e-17 5.0345712e-16)
(6.890995e-18 3.4454975e-17 -5.7424958e-16)
(-1.0895443e-17 -5.4477214e-17 8.3418233e-16)
(2.2661799e-18 1.1330899e-17 -4.9130072e-16)
(0 -0 2.5416748e-16)
(5.7788285e-19 2.8894142e-18 -9.8556114e-16)
...
)
;
    }
    open001
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(1.9108408e-18 9.5542039e-18 -1.6879094e-15)
(1.2780172e-18 6.3900862e-18 -2.7157866e-16)
(2.2376077e-18 1.1188039e-17 3.775963e-16)
(0 -0 2.7276297e-16)
(5.4476487e-19 2.7238244e-18 -3.4047805e-17)
(0 -0 -7.3299122e-16)
(0 -0 2.7039498e-15)
(0 -0 -2.0140211e-15)
...
)
;
    }
    emptyWalls
    {
        type            empty;
    }
}


// ************************************************************************* //
